## Pandas

### 1. Pandas DataFrame and Operations

In [3]:
# pandas 라이브러리를 불러옵니다. pd를 약칭으로 사용합니다.
!pip install pandas

Requirement already satisfied: pandas in /Users/sainthm/opt/anaconda3/envs/sainthm/lib/python3.8/site-packages (1.4.3)
Requirement already satisfied: numpy>=1.18.5 in /Users/sainthm/opt/anaconda3/envs/sainthm/lib/python3.8/site-packages (from pandas) (1.23.2)
Requirement already satisfied: pytz>=2020.1 in /Users/sainthm/opt/anaconda3/envs/sainthm/lib/python3.8/site-packages (from pandas) (2022.2.1)
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/sainthm/opt/anaconda3/envs/sainthm/lib/python3.8/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /Users/sainthm/opt/anaconda3/envs/sainthm/lib/python3.8/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [6]:
# import numpy ad np
# import pandas as pd
# import matplotlib.pyplt as plt
# import seaborn as sns

import pandas as pd
pd.__version__

'1.4.3'

- DataFrame은 2차원 테이블이고, 테이블의 한 줄(행/열)을 Series라고 합니다.


- Series의 모임이 곧, DataFrame이 됩니다.

In [7]:
# s는 1, 3, 5, 6, 8을 원소로 가지는 pandas.Series
pd.Series([1, 3, 5, 6, 8]) # 대문자 S! , 리스트와 비슷하다고 이해하자

0    1
1    3
2    5
3    6
4    8
dtype: int64

In [9]:
# 6x4 행렬에 1부터 24까지의 숫자를 원소를 가지고, columns은 순서대로 X1, X2, X3, X4로 하는 DataFrame 생성, 판다스의 근본 데이터프레임!
df = pd.DataFrame(data=[[1, 2, 3, 4],
                        [5, 6, 7, 8],
                        [9, 10, 11, 12],
                        [13, 14, 15, 16],
                        [17, 18, 19, 20],
                        [21, 22, 23, 24]],
                  columns=["X1", "X2", "X3", "X4"])
df

   X1  X2  X3  X4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24

In [10]:
# dataframe index
df.index

RangeIndex(start=0, stop=6, step=1)

In [11]:
# dataframe columns
df.columns

Index(['X1', 'X2', 'X3', 'X4'], dtype='object')

In [12]:
# dataframe values
df.values

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20],
       [21, 22, 23, 24]])

In [18]:
# 특정 column을 가져오기
df["X1"] # pd.series

0     1
1     5
2     9
3    13
4    17
5    21
Name: X1, dtype: int64

In [21]:
# X1 column에 2 더하기
df["X1"] + 2 # broadcasting 가능!, 문자열이라면 문자열 concat도 가능!

0     3
1     7
2    11
3    15
4    19
5    23
Name: X1, dtype: int64

### 2.1. Dataframe 기초 method

In [23]:
# dataframe의 맨 위 다섯줄을 보여주는 head()
df.head(3) # 위에서부터 세 줄 출력!

   X1  X2  X3  X4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12

In [24]:
# 10줄
df.head(10)

   X1  X2  X3  X4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24

In [25]:
# 자매품으로 밑에서부터 보는 tail!
df.tail(2)

   X1  X2  X3  X4
4  17  18  19  20
5  21  22  23  24

In [29]:
# dataframe에 대한 전체적인 요약정보를 보여줍니다. index, columns, null/not-null/dtype/memory usage가 표시됩니다.
df.info()
# NULL > 컴퓨터의 '없음' 표시
# non-null: 없지 않음, 해당 데이터에 비어있지 않는 데이터의 수, 빈 칸이 몇개나 있는지에대한 정보

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      6 non-null      int64
 1   X2      6 non-null      int64
 2   X3      6 non-null      int64
 3   X4      6 non-null      int64
dtypes: int64(4)
memory usage: 320.0 bytes

In [30]:
# dataframe에 대한 전체적인 통계정보를 보여줍니다.
df.describe()

              X1         X2         X3         X4
count   6.000000   6.000000   6.000000   6.000000
mean   11.000000  12.000000  13.000000  14.000000
std     7.483315   7.483315   7.483315   7.483315
min     1.000000   2.000000   3.000000   4.000000
25%     6.000000   7.000000   8.000000   9.000000
50%    11.000000  12.000000  13.000000  14.000000
75%    16.000000  17.000000  18.000000  19.000000
max    21.000000  22.000000  23.000000  24.000000

In [33]:
# X2 column를 기준으로 내림차순 정렬
# df.sort_values(by="X2") # 특정 컬럼을 기준으로 정렬
df.sort_values(by="X2", ascending=False) # 오름차순으로 정렬

   X1  X2  X3  X4
5  21  22  23  24
4  17  18  19  20
3  13  14  15  16
2   9  10  11  12
1   5   6   7   8
0   1   2   3   4

In [36]:
df.loc[2, 'X2'] = 10
df

   X1  X2  X3  X4
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20
5  21  22  23  24

### 2.2. Fancy Indexing ! (***)

- 데이터를 filtering <=> Search !

- 전체 데이터에서 원하는 일부의 데이터를 찾아오는 방법 !

In [ ]:
# pandas dataframe은 column 이름을 이용하여 기본적인 Indexing이 가능합니다.

In [ ]:
# dataframe에서 slicing을 이용하면 row 단위로 잘려나옵니다.

In [ ]:
# df.loc에 2차원 indexing도 가능합니다.
## df.loc[index, column_name]
df.loc[7, "X1"]  # index값이 7이고, column 이름이 'X1'인 데이터.

In [ ]:
# dataframe에 조건식을 적용해주면 조건에 만족하는지 여부를 알려주는 "mask"가 생깁니다.

In [ ]:
# iloc로 2차원 indexing을 하게되면, row 기준으로 index 3,4를 가져오고 column 기준으로 0, 1을 가져옵니다.

In [ ]:
# Q. 2차원 indexing에 뒤에가 : 면 어떤 의미일까요?

### 2.3 DataFrame으로 데이터 불러오기

In [ ]:
# csv 파일 불러오기
data = pd.read_csv('data/') # 엄청 나게 자주 쓸 함수

In [ ]:
# 엑셀 파일 불러오기
data =